 # 案例15: 实现下面的功能：
#     有一个列表mlist如下：
#     mlist = [{'sid':'501','7月': 9000,'8月':9500,'9月':9200},
#             {'sid':'502','7月': 8000,'8月':8500,'9月':8200},
#             {'sid':'503','7月': 7000,'8月':7500,'9月':7200}]	
#     输出结果如下:
#     {'501': [9000, 9500, 9200], '502': [8000, 8500, 8200], '503': [7000, 7500, 7200]}
mlist = [{'sid':'501','7月': 9000,'8月':9500,'9月':9200},
             {'sid':'502','7月': 8000,'8月':8500,'9月':8200},
             {'sid':'503','7月': 7000,'8月':7500,'9月':7200}]
new_mlist ={}
new_keys = ''
new_values = 0
for item in mlist:
    new_keys = item.pop('sid')
    new_values = item.values()
    new_mlist.update({new_keys:list(new_values)})
print(new_mlist)
